import re

def try_list():
    lst = ["one", "two", "three"]
    lst.remove(1)
    print(lst)

def try_regex():
    """
    2018-07-10 10:32:51 null
    2018-06-15 4:04:50 王珺儒
    2020-06-21 8:39:17 王珺儒 只聊游戏和商品
    """
    #(?P<year>^\d{4} )-(?P<month>\d{2})-(?P<day>\d{2} )
    test_strings = ["2018-07-10 10:32:51 null", '2018-06-15 4:04:50 王珺儒',
                   "2020-06-21 8:39:17 王珺儒 只聊游戏和商品", "2020-05-21 5:34:55 現實逃避p(1908687236)",
                   "2020-05-21 5:35:45 Βασιλιάς<katiaykjln@hotmail.com>", "2020-06-26 9:00:54 提醒基德小助手(2487878871)"]
    # re_string = r'^(?:[2-9]\d\d\d)-(?:1[012]|0?[1-9])?-(?:31(?' \
    #             '!.(?:0?[2469]|11))|(?:30|29)(?!.0?2)|29(?=' \
    #             '.0?2.(?:(?:(?:1[6-9]|[2-9]\d)?(?:0[48]|[2468]' \
    #             '[048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26]' \
    #             ')00)))(?:T))|(?:2[0-8]|1\d|0?[1-9])).*'

    # r'^(?P<year>\d{4})-(?P<month>\d{2})-(?P<day>\d{2})\s(?P<hour>\d{1,2}):(?Pd\d{2}:\d{2}\s.*$'
    re_string = r'^(?P<date>\d{4}-\d{2}-\d{2}\s\d{1,2}:\d{2}:\d{2})\s.*$'
    for string in test_strings:
        if (re.match(re_string, string)):
            print(string, "yes")
        else:
            print(string, "no")



if __name__ == '__main__':
    try_regex()